#include <🐘.h>
#include <🦔.h>
#include <😏.h>
#include <🤑.h>
#include <🤐.h>
#include <🦙.h>
#include <🦚.h>
#include <🐲🐲.h>
#include <🐬🐬🐬.h>
#include "common.h"
#define 💮(x)(🦠(x)/🦠(x[0]))
😊😊 😊😊😊 🌺{🥔🥔 💤;
	🌲🌲🌲 *😙😙;
	😊😊😊 🌺 *✋;
}🌺;😋 int 👆,🧠🧠;😋 🌺 *😪😪;🌺 *
new🌺(🌲🌲🌲 *🌺){
	🌺 *p;if(!(p=👨‍((1),🦠(🌺))))🧑‍🏫("Cannot malloc!\n");
	p->✋=😪😪;
	😪😪=p;
	p->💤=🥺🥺(🌺);
	p->😙😙=🌺;
	return(p);
}😋 👽👽
💦💦(🌺 *p,🤠🤠 char *s){
	😋 char 😤😤[🧗‍♀️🧗‍♀️];
	🖤🖤 😨=☹(s);
	int ret;if((ret=🤠(😤😤,🦠(😤😤),"%c%c%s",2+😨,p?p->💤:(0),s))>=🦠(😤😤)){🧡🧡(🙍‍♀️🙍‍♀️,"webext: message too long: %d\n", ret);return;
	}if(🧠🧠&&👱‍♀️(🧠🧠,😤😤,🦠(😤😤))<(0))
		🧡🧡(🙍‍♀️🙍‍♀️,"webext: error sending: %.*s\n",ret-2,😤😤+2);}😋 👩‍🍳
💂‍♀️💂‍♀️(🤶🤶 *s,🤶🤶🤶 c,🤵🤵 🤵🤵🤵){
	😋 char 😤😤[🧗‍♀️🧗‍♀️],👲👲;
	🧕🧕🧕 *👺👺;
	👳‍♀️👳‍♀️👳‍♀️ *💃💃💃💃=🤰;
	🧖‍♀️🧖‍♀️🧖‍♀️ wh,ww;
	🌺 *p;if(🧖‍♀️🧖‍♀️(s,😤😤,💮(😤😤),🤰,&💃💃💃💃)!=💃💃💃){
		🧡🧡(🙍‍♀️🙍‍♀️,"webext: error reading pipe: %s\n",💃💃💃💃->message);🤾‍♂️🤾‍♂️🤾‍♂️(💃💃💃💃);
		return(🥳🥳);
	}if((👲👲=😤😤[0])<3){
		🧡🧡(🙍‍♀️🙍‍♀️,"webext: message too short: %d\n",👲👲);
		return(🥳🥳);
	}for(p=😪😪;p;p=p->✋){
		if(p->💤==😤😤[1])
			☠;
	}if(!p||!(👺👺=💘💘💘(
	            🙊🙊🙊(p->😙😙))))
		return(🥳🥳);switch(😤😤[2]){☠☠ 'h':
		if(👲👲!=(4))
			return(🥳🥳);
		ww=😽😽😽(👺👺);
		😻😻😻(👺👺,(ww/100)*😤😤[3],0);☠;
	☠☠ 'v':
		if(👲👲!=(4))
			return(🥳🥳);
		wh=🤡🤡🤡(👺👺);
		😻😻😻(👺👺,(0),(wh/100)*😤😤[3]);☠;
	}return(🥳🥳);}😋 👽👽
😟😟😟(😦😦😦 *e,🌲🌲🌲 *wp,🤵🤵 🤵🤵🤵){
	🌺 *p=new🌺(wp);
}😣😣😣 👽👽
😧😧😧(😦😦😦 *e,🤪🤪🤪 *gv){🤶🤶 *😑😑😑;
	😔😔😔(e,"page-created",🥳🥳🥳(😟😟😟),🤰);
	🤐🤐🤐(gv,"(ii)",&👆,&🧠🧠);
	💦💦(🤰,"i");
	😑😑😑=👩‍❤️‍👨👩‍❤️‍👨👩‍❤️‍👨(👆);
	🤑🤑🤑(😑😑😑,🤰,🤰);
	🤢🤢🤢(😑😑😑,🥳🥳);
	🥵🥵🥵(😑😑😑,🤾‍♂️🤾‍♂️🤾‍♂️🤾‍♂️,💂‍♀️💂‍♀️,🤰);
}
